tutorials/verificationAndValidation/RAS/PCF/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    lowerWall
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            symmetry;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 1.0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
