tutorials/verificationAndValidation/RAS/PCF/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


type            sets;
libs            (sampling);
writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;
fields          (U turbulenceProperties:k turbulenceProperties:R turbulenceProperties:nut);

sets
(
    Uref
    {
        type    cloud;
        axis    y;
        points  ((0.5 1 0.5));
    }

    y_profile
    {
        type    midPoint;
        axis    y;
        start   (0.5 0 0.5);
        end     (0.5 1 0.5);
    }
);

