tutorials/verificationAndValidation/RAS/PCF/system/stressComponents
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (R k nut);
